# Introduction to Pandas dataframe

> 1. Data frame is a main object in pandas. It is used to represent data with rows and columns
> 2. Data frame is a datastructure represent the data in tabular or excel spread sheet like data)

#### creating dataframe:

In [ ]:
T = "Python, CSK MI IPL Garbage #$%"
print(T[1:4:2])
print(T)

yh
Python, CSK MI IPL Garbage #$%

In [3]:
import pandas as pd
df = pd.read_csv('nyc_weather.csv')
print(df)

           EST  Temperature  DewPoint  Humidity  Sea Level PressureIn  \
0   01-01-2016           38        23        52                 30.03
1   01-02-2016           36        18        46                 30.02
2   01-03-2016           40        21        47                 29.86
3   01-04-2016           25         9        44                 30.05
4   01-05-2016           20        -3        41                 30.57
5   01-06-2016           33         4        35                 30.50
6   01-07-2016           39        11        33                 30.28
7   01-08-2016           39        29        64                 30.20
8   01-09-2016           44        38        77                 30.16
9   01-10-2016           50        46        71                 29.59
10  01-11-2016           33         8        37                 29.92
11  01-12-2016           35        15        53                 29.85
12   1/13/2016           26         4        42                 29.94
13   1/14/2016           30        12        47                 29.95
14   1/15/2016           43        31        62                 29.82
15   1/16/2016           47        37        70                 29.52
16   1/17/2016           36        23        66                 29.78
17   1/18/2016           25         6        53                 29.83
18   1/19/2016           22         3        42                 30.03
19   1/20/2016           32        15        49                 30.13
20   1/21/2016           31        11        45                 30.15
21   1/22/2016           26         6        41                 30.21
22   1/23/2016           26        21        78                 29.77
23   1/24/2016           28        11        53                 29.92
24   1/25/2016           34        18        54                 30.25
25   1/26/2016           43        29        56                 30.03
26   1/27/2016           41        22        45                 30.03
27   1/28/2016           37        20        51                 29.90
28   1/29/2016           36        21        50                 29.58
29   1/30/2016           34        16        46                 30.01
30   1/31/2016           46        28        52                 29.90

    VisibilityMiles  WindSpeedMPH PrecipitationIn  CloudCover    Events  \
0                10           8.0               0           5       NaN
1                10           7.0               0           3       NaN
2                10           8.0               0           1       NaN
3                10           9.0               0           3       NaN
4                10           5.0               0           0       NaN
5                10           4.0               0           0       NaN
6                10           2.0               0           3       NaN
7                10           4.0               0           8       NaN
8                 9           8.0               T           8      Rain
9                 4           NaN             1.8           7      Rain
10               10           NaN               0           1       NaN
11               10           6.0               T           4       NaN
12               10          10.0               0           0       NaN
13               10           5.0               T           7       NaN
14                9           5.0               T           2       NaN
15                8           7.0            0.24           7      Rain
16                8           6.0            0.05           6  Fog-Snow
17                9          12.0               T           2      Snow
18               10          11.0               0           1       NaN
19               10           6.0               0           2       NaN
20               10           6.0               0           1       NaN
21                9           NaN            0.01           3      Snow
22                1          16.0            2.31           8  Fog-Snow
23                8           6.0               T           3      Snow
24               10           3.0               0           2       NaN
25               10           7.0               0           2       NaN
26               10           7.0               T           3      Rain
27               10           5.0               0           1       NaN
28               10           8.0               0           4       NaN
29               10           7.0               0           0       NaN
30               10           5.0               0           0       NaN

    WindDirDegrees
0              281
1              275
2              277
3              345
4              333
5              259
6              293
7               79
8               76
9              109
10             289
11             235
12             284
13             266
14             101
15             340
16             345
17             293
18             293
19             302
20             312
21              34
22              42
23             327
24             286
25             244
26             311
27             234
28             298
29             257
30             241

In [4]:
#Another way to view data frame as list of tuples

weather_data = [('1/1/2017', 32, 6, 'Rain'),
                ('1/2/2017', 35, 7, 'Sunny'),
                ('1/3/2017', 28, 2, 'Snow'),
                ('1/4/2017', 24, 7, 'Snow'),
                ('1/5/2017', 32, 4, 'Rain'),
                ('1/6/2017', 31, 2, 'Sunny')
               ]
# weather data is a list of tuples 
df = pd.DataFrame(weather_data, columns=['day', 'temperature', 'windspeed', 'event'])
df # this is a data frame coneverted by pd.DataFrame() function

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [5]:
df.head(5) # returns first 5 elements of data frame

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [6]:
df.tail(2) # returns last 5 elements of data frame

        day  temperature  windspeed  event
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [7]:
df[2:4] # prints elements from index 2 to 4

        day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow

In [8]:
list(df.columns) # Prints columns of data frame

['day', 'temperature', 'windspeed', 'event']

In [9]:
eventSeries = df.event # returns day column from df
type(eventSeries)

pandas.core.series.Series

In [10]:
eventSeries[0] = 'Cow'

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [11]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6    Cow
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [12]:
eventSeries = df.event.copy()

In [13]:
eventSeries[0] = 'Hen'

In [14]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6    Cow
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [15]:
eventSeries

0      Hen
1    Sunny
2     Snow
3     Snow
4     Rain
5    Sunny
Name: event, dtype: object

In [16]:
l = df.windspeed # returns windspeed column from df
type(l)

pandas.core.series.Series

In [17]:
df[['day', 'event']] # returns two columns mentioned

        day  event
0  1/1/2017    Cow
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017   Rain
5  1/6/2017  Sunny

In [18]:
df['temperature'].mean() # returns mean of temperature column

30.333333333333332

In [19]:
df['temperature'].max() # returns max of temperature column

35

In [20]:
df['temperature'].describe() # Returns statistical information of mentioned columns

count     6.000000
mean     30.333333
std       3.829708
min      24.000000
25%      28.750000
50%      31.500000
75%      32.000000
max      35.000000
Name: temperature, dtype: float64

In [21]:
df[['temperature', 'windspeed']].describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [22]:
df['temperature'].max()

35

In [23]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6    Cow
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [24]:
df[df.event == 'Sunny'][['temperature','windspeed']]

   temperature  windspeed
1           35          7
5           31          2

In [25]:
df1 = df[df.windspeed == df['windspeed'].max()]
df1['day'] #

1    1/2/2017
3    1/4/2017
Name: day, dtype: object

In [26]:
df[df.windspeed == df['windspeed'].max()]

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
3  1/4/2017           24          7   Snow

In [ ]:
df[df['event'] == 'Rain']['day']

4    1/5/2017
Name: day, dtype: object

In [ ]:
df.day[df['event'] == 'Rain']

4    1/5/2017
Name: day, dtype: object

In [ ]:
df[df.temperature == df['temperature'].min()] # select rows which has maximum temperature

        day  temperature  windspeed event
3  1/4/2017           24          7  Snow

In [ ]:
df.temperature == df['temperature'].max()

0    False
1     True
2    False
3    False
4    False
5    False
Name: temperature, dtype: bool

In [ ]:
df.day[df.temperature == df['temperature'].min()] #select only day column which has maximum temperature

3    1/4/2017
Name: day, dtype: object

# Read and write CSV and XLS files

In [28]:
import pandas as pd
df = pd.read_csv('nyc_weather.csv')
df

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,01-01-2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,01-02-2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,01-03-2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,01-04-2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,01-05-2016,20,-3,41,30.57,10,5.0,0,0,NaN,333
5,01-06-2016,33,4,35,30.50,10,4.0,0,0,NaN,259
6,01-07-2016,39,11,33,30.28,10,2.0,0,3,NaN,293
7,01-08-2016,39,29,64,30.20,10,4.0,0,8,NaN,79
8,01-09-2016,44,38,77,30.16,9,8.0,T,8,Rain,76
9,01-10-2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109
10,01-11-2016,33,8,37,29.92,10,NaN,0,1,NaN,289
11,01-12-2016,35,15,53,29.85,10,6.0,T,4,NaN,235
12,1/13/2016,26,4,42,29.94,10,10.0,0,0,NaN,284
13,1/14/2016,30,12,47,29.95,10,5.0,T,7,NaN,266
14,1/15/2016,43,31,62,29.82,9,5.0,T,2,NaN,101
15,1/16/2016,47,37,70,29.52,8,7.0,0.24,7,Rain,340
16,1/17/2016,36,23,66,29.78,8,6.0,0.05,6,Fog-Snow,345
17,1/18/2016,25,6,53,29.83,9,12.0,T,2,Snow,293
18,1/19/2016,22,3,42,30.03,10,11.0,0,1,NaN,293
19,1/20/2016,32,15,49,30.13,10,6.0,0,2,NaN,302
20,1/21/2016,31,11,45,30.15,10,6.0,0,1,NaN,312
21,1/22/2016,26,6,41,30.21,9,NaN,0.01,3,Snow,34
22,1/23/2016,26,21,78,29.77,1,16.0,2.31,8,Fog-Snow,42
23,1/24/2016,28,11,53,29.92,8,6.0,T,3,Snow,327
24,1/25/2016,34,18,54,30.25,10,3.0,0,2,NaN,286
25,1/26/2016,43,29,56,30.03,10,7.0,0,2,NaN,244
26,1/27/2016,41,22,45,30.03,10,7.0,T,3,Rain,311
27,1/28/2016,37,20,51,29.90,10,5.0,0,1,NaN,234
28,1/29/2016,36,21,50,29.58,10,8.0,0,4,NaN,298
29,1/30/2016,34,16,46,30.01,10,7.0,0,0,NaN,257
30,1/31/2016,46,28,52,29.90,10,5.0,0,0,NaN,241

In [31]:
pip3 install xlrd
#read excel file 
df = pd.read_excel('nyc_weather.csv')
print(df)
#type(df['temperature'].values) # values give numpy array

SyntaxError: invalid syntax (<ipython-input-31-52b18cce1a6d>, line 1)

1. As you can observe both files created using below functions df.to_csv()
2. By default a column is inserted at the time of csv file creation i.e. index column starting eith 0
3. To avoid this column you may add argument as index =False

In [ ]:
print(df)
df['temperature'] = 44
print(df)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny
        day  temperature  windspeed  event
0  1/1/2017           44          6   Rain
1  1/2/2017           44          7  Sunny
2  1/3/2017           44          2   Snow
3  1/4/2017           44          7   Snow
4  1/5/2017           44          4   Rain
5  1/6/2017           44          2  Sunny

In [ ]:
#write DF to csv
#df.to_csv('new1.csv') # new.csv file created and data frame df will be stored in it
df.to_csv('new_noIndex.csv', index=False) # new_noIndex.csv file created and data frame df will be stored in it

In [ ]:
# INSTALL: pip3 install openpyxl
#write DF to Excel
df.to_excel('new.xlsx', sheet_name='weather_data') 
# A new.xlsx file created. An excel sheet may have multiple sheets we can name the sheets as well

In [ ]:
import pandas as pd
df = pd.read_csv('weather_data_cities.csv')
df #weather by cities

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [ ]:
groups = df.groupby('city')
print(groups) # this will not print data

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f0f7fe19e80>

> 1. When groupby method used on data frame it groups the data frame according to the cities.
> 2. So two columns are returned first city name and second column conrtains data frame w.r.t. that city

1. city 
  > dataframe
2. city
  > dataframe
3. city
  > dataframe
    .
    .
    .
    .
    
To print values of groups we have to use for loop to print city and respective dataframe

In [ ]:
for city, city_frame in groups:   # city as first dimension and city_frame as second dimensiosn
    print(city) 
    print(city_frame)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [ ]:
cityTempMean = df.groupby('city')['temperature'].mean()
cityTempMean

city
mumbai      88.50
new york    32.25
paris       47.75
Name: temperature, dtype: float64

In [ ]:
df['city']['temperature'].mean()

KeyError: ignored

In [ ]:
groupsEvent = df.groupby('event')
print(groupsEvent)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f0f7fe12b70>

In [ ]:
for event, event_frame in groupsEvent:
  print(event)
  print(event_frame)

Cloudy
         day   city  temperature  windspeed   event
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy
Fog
        day    city  temperature  windspeed event
5  1/2/2017  mumbai           85         12   Fog
6  1/3/2017  mumbai           87         15   Fog
Rain
        day      city  temperature  windspeed event
0  1/1/2017  new york           32          6  Rain
7  1/4/2017    mumbai           92          5  Rain
Snow
        day      city  temperature  windspeed event
2  1/3/2017  new york           28         12  Snow
Sunny
        day      city  temperature  windspeed  event
1  1/2/2017  new york           36          7  Sunny
3  1/4/2017  new york           33          7  Sunny
4  1/1/2017    mumbai           90          5  Sunny
8  1/1/2017     paris           45         20  Sunny

In [ ]:
# To get only one group of data
groups.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [ ]:
groups.get_group('mumbai').describe()

       temperature  windspeed
count     4.000000   4.000000
mean     88.500000   9.250000
std       3.109126   5.057997
min      85.000000   5.000000
25%      86.500000   5.000000
50%      88.500000   8.500000
75%      90.500000  12.750000
max      92.000000  15.000000

In [ ]:
groups.get_group('new york').describe()

       temperature  windspeed
count     4.000000   4.000000
mean     32.250000   8.000000
std       3.304038   2.708013
min      28.000000   6.000000
25%      31.000000   6.750000
50%      32.500000   7.000000
75%      33.750000   8.250000
max      36.000000  12.000000

In [ ]:
groups.mean() # returns max value of every column for each city

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [ ]:
df[df.city == 'mumbai']['temperature'].mean()
df[df.city == 'new york']['temperature'].mean()
df[df.city == 'paris']['temperature'].mean()

47.75

In [ ]:
groups.mean() # only numerical valued columns are considered

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [ ]:
# To print all statistical data w.r.t. each city
groups.describe()

         temperature                         ... windspeed
               count   mean       std   min  ...       25%   50%    75%   max
city                                         ...
mumbai           4.0  88.50  3.109126  85.0  ...      5.00   8.5  12.75  15.0
new york         4.0  32.25  3.304038  28.0  ...      6.75   7.0   8.25  12.0
paris            4.0  47.75  5.315073  42.0  ...      9.50  11.5  14.75  20.0

[3 rows x 16 columns]

## concatenate Data Frames

In [32]:
import pandas as pd

india_weather = pd.DataFrame({
    "city": ['mumbai','delhi','Kolkata'],
    "Temperature": [50,55,60],
    "humidity": [43,65,87]   
})

# this way we can create a data frame. Note that inside data frame we have dictionary i.e. key value pair
india_weather

      city  Temperature  humidity
0   mumbai           50        43
1    delhi           55        65
2  Kolkata           60        87

In [ ]:

us_weather = pd.DataFrame({
    "city": ['new york','san diago','chicago'],
    "temperature": [50,55,60],
    "humidity": [43,65,87],
    "Population": [1,2,3]  
})

# this way we can create a data frame. Note that inside data frame we have dictionary i.e. key value pair
us_weather

        city  temperature  humidity  Population
0   new york           50        43           1
1  san diago           55        65           2
2    chicago           60        87           3

In [ ]:
df = pd.concat([india_weather,us_weather])
df
# Note that indices from both dfs are copied as it is

        city  Temperature  humidity  temperature  Population
0     mumbai         50.0        43          NaN         NaN
1      delhi         55.0        65          NaN         NaN
2    Kolkata         60.0        87          NaN         NaN
0   new york          NaN        43         50.0         1.0
1  san diago          NaN        65         55.0         2.0
2    chicago          NaN        87         60.0         3.0

In [ ]:
# avoid index term
df1 = pd.concat([india_weather,us_weather], ignore_index = True)
df1
# now indices are

        city  temperature  humidity
0     mumbai           50        43
1      delhi           55        65
2    Kolkata           60        87
3   new york           50        43
4  san diago           55        65
5    chicago           60        87

In [ ]:
df2 = pd.concat([india_weather, us_weather],axis = 1) 
df2 # axis = 0 concates row wise and axis = 1 concates column wise

      city  temperature  humidity       city  temperature  humidity
0   mumbai           50        43   new york           50        43
1    delhi           55        65  san diago           55        65
2  Kolkata           60        87    chicago           60        87

## Merging of two data frames
This almost works like join query

In [33]:
import pandas as pd
temp = pd.DataFrame({
    "city": ['Mumbai', 'Delhi', 'Kolkata'],
    "temperature": [42, 37, 44]    
}) # Temperature data frame contains temperature of cites
temp

      city  temperature
0   Mumbai           42
1    Delhi           37
2  Kolkata           44

In [ ]:
hum = pd.DataFrame({
     "city": ['Mumbai', 'Delhi', 'Hyderabad'],
    "humidity": [43,56,87]
})
hum

        city  humidity
0     Mumbai        43
1      Delhi        56
2  Hyderabad        87

In [ ]:
df = pd.merge(temp,hum,on='city', how = 'outer')
df

        city  temperature  humidity
0     Mumbai         42.0      43.0
1      Delhi         37.0      56.0
2    Kolkata         44.0       NaN
3  Hyderabad          NaN      87.0

In [ ]:
wind = pd.DataFrame({
    "city": ['Mumbai', 'Delhi', 'Benglore'],
    "wind": [122,154,121]
})

In [ ]:
df2 = pd.merge(temp,wind,on='city') # deault join note the cities in final merged output
df2                                 # by default it applies inner join

     city  temperature  wind
0  Mumbai           42   122
1   Delhi           37   154

In [ ]:
df3 = pd.merge(temp,wind,on='city', how='inner') # default join note the cities in final merged output
df3

     city  temperature  wind
0  Mumbai           42   122
1   Delhi           37   154

## Indexing in a data frame

In [ ]:
df = pd.DataFrame({"Key": [22,33,21,34,24,13,13,434,545,676]})
df
# as you can observe below separate indices are provided starting with 0
# These can also be referred as row numbers 
# you can also assign your own idices

   Key
0   22
1   33
2   21
3   34
4   24
5   13
6   13
7  434
8  545
9  676

In [ ]:
# You can also use your own indices rather than defaults
df = pd.DataFrame({"Key":[22,33,21,34,24,13,13,434,545,676]}, index = [10,9,5,7,6,54,4,3,2,1])
df

    Key
10   22
9    33
5    21
7    34
6    24
54   13
4    13
3   434
2   545
1   676

In [ ]:
# To access data frame entries using index number, use loc[]
df.loc[5:9]

Empty DataFrame
Columns: [Key]
Index: []

In [ ]:
# To access data frame entries using index number, use iloc[]
df.iloc[0:5]

    Key
10   22
9    33
5    21
7    34
6    24

In [ ]:
temp.iloc[2]

city           Benglore
temperature          44
Name: 2, dtype: object

In [ ]:
import pandas as pd
import numpy as np

# crete a sample dataframe
data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', np.NAN, 'yellow', np.NAN, 'black', 'green', 'red']
})

# view the data
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [ ]:
data.loc[0,:] # Retrive all columns of row 0 
# First entry is row index and next is columns

age                     10
section                  A
city               Gurgaon
gender                   M
favourite_color        red
Name: 0, dtype: object

In [ ]:
data.iloc[0,:] # Retrive all columns of row 0 
# First entry is row index and next is columns

age                     10
section                  A
city               Gurgaon
gender                   M
favourite_color        red
Name: 0, dtype: object

In [ ]:
data.loc[[0,1,3],:]  # row number 0, 1, 3 and all columns

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
3   21       B    Delhi      M             NaN

In [ ]:
data.loc[0:3, ['city','gender']]

      city gender
0  Gurgaon      M
1    Delhi      F
2   Mumbai      F
3    Delhi      M

In [ ]:
# select all cities with all rows
data.loc[:,'city']

0    Gurgaon
1      Delhi
2     Mumbai
3      Delhi
4     Mumbai
5      Delhi
6     Mumbai
Name: city, dtype: object

In [ ]:
data.loc[0:3, ['age','gender']]

  gender favourite_color
2      F          yellow
3      M             NaN
4      M           black

In [ ]:
data.city[0:6]

0    Gurgaon
1      Delhi
2     Mumbai
3      Delhi
4     Mumbai
5      Delhi
Name: city, dtype: object

In [ ]:
data.loc[:, 'age':'gender']

   age section     city gender
0   10       A  Gurgaon      M
1   22       B    Delhi      F
2   13       C   Mumbai      F
3   21       B    Delhi      M
4   12       B   Mumbai      M
5   11       A    Delhi      M
6   17       A   Mumbai      F

In [ ]:
data.loc[data.gender == 'M']

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green

In [ ]:
# calculate mean of age for male
data.loc[data.gender == 'F']['age'].mean()

17.333333333333332

In [ ]:
data.loc[data.gender == 'M', ['gender','city']]

  gender     city
0      M  Gurgaon
3      M    Delhi
4      M   Mumbai
5      M    Delhi

In [ ]:
# select all rows with a condition
data.loc[data.age >= 15]

   age section    city gender favourite_color
1   22       B   Delhi      F             NaN
3   21       B   Delhi      M             NaN
6   17       A  Mumbai      F             red

In [ ]:
data.loc[(data.age >= 12) & (data.gender == 'M')]

   age section    city gender favourite_color
3   21       B   Delhi      M             NaN
4   12       B  Mumbai      M           black

In [ ]:
#slice
data.loc[1:3]

   age section    city gender favourite_color
1   22       B   Delhi      F             NaN
2   13       C  Mumbai      F          yellow
3   21       B   Delhi      M             NaN

In [ ]:
# select few columns with a condition
data.loc[(data.age >= 12), ['city', 'gender']]

     city gender
1   Delhi      F
2  Mumbai      F
3   Delhi      M
4  Mumbai      M
6  Mumbai      F

In [ ]:
# update a column with condition
data.loc[(data.age >= 12), ['section']] = 'M'
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       M    Delhi      F             NaN
2   13       M   Mumbai      F          yellow
3   21       M    Delhi      M             NaN
4   12       M   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       M   Mumbai      F             red

In [ ]:
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [ ]:
# update multiple columns with condition
data.loc[(data.age >= 20), ['section', 'city']] = ['S','Pune']
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       S     Pune      F             NaN
2   13       C   Mumbai      F          yellow
3   21       S     Pune      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [ ]:
data.columns = ['Age', 'Section', 'City','Gender', 'Favourite_color']

In [ ]:
data

   Age Section     City Gender Favourite_color
0   10       A  Gurgaon      M             red
1   22       S     Pune      F             NaN
2   13       C   Mumbai      F          yellow
3   21       S     Pune      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [ ]:
data.iloc[:,0:3] # in iloc we can specify integer index for columns also

   age section     city
0   10       A  Gurgaon
1   22       S     Pune
2   13       M   Mumbai
3   21       S     Pune
4   12       M   Mumbai
5   11       A    Delhi
6   17       M   Mumbai

In [ ]:
data[0:3] # By default it uses iloc

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       S     Pune      F             NaN
2   13       M   Mumbai      F          yellow

In [ ]:
df = pd.DataFrame({"Key":[22,33,21,34,24,13,13,434,545,676]}, index = [10,9,5,7,6,54,4,3,2,1])
df

    Key
10   22
9    33
5    21
7    34
6    24
54   13
4    13
3   434
2   545
1   676

In [ ]:
df.iloc[0:3]

    Key
10   22
9    33
5    21

# loc
1. loc access rows of DF using index (you may have your own custom index)
<br> Eg. DF.loc[start_index:end_index]
    end_index is inclusive
2. loc access columns using column names
   <br> Eg.
    DF.loc[:,[column_name1, column_name2, .....]]
# iloc
1.  iloc access rows of DF using row numbers
   <br> Eg. DF[start_row_number: end_row_number]
2. iloc access columns using column numbers
  <br> Eg. DF[start_col_number: end_col_number]

In [ ]:
df.loc[0:3]

KeyError: ignored

In [ ]:
df.loc[10:54]

    Key
10   22
9    33
5    21
7    34
6    24
54   13